app/views/workflow/inventory_items/show.html.erb

SELECT  "images".* FROM "images" WHERE "images"."inventory_item_id" = ? LIMIT ?  [["inventory_item_id", 1011], ["LIMIT", 1]]
---
        min-height: 30px;
        background: url("<%= @item.image.first_source %>");