app/controllers/workflow/images_controller.rb

SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1011], ["LIMIT", 1]]
---
  def new
    @image = Image.new
    @item = InventoryItem.find(params[:id])

INSERT INTO "images" ("sources", "created_at", "updated_at", "inventory_item_id") VALUES (?, ?, ?, ?)
---
  def create
    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save