app/controllers/workflow/inventory_items_controller.rb

    def create
        @item = InventoryItem.new(item_params)

        respond_to do |format|
            if @item.save
---
INSERT INTO "inventory_items" ("item_name", "item_brand", "item_description", "item_condition", "market_value", "in_stock", "created_at", "updated_at", "item_owner_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

        def set_item
            @item = InventoryItem.find_by(id: params[:id])
---
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1011], ["LIMIT", 1]]