app/controllers/inventory_items/inventory_items_controller.rb

    def set_item
        id = params[:slug].split("-")[0]
        @item = InventoryItem.find_by(id: id)
---
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 511], ["LIMIT", 1]]