app/controllers/item_owners/item_owners_controller.rb

  def initialize_prf
    @pr = PickupRequest.create(
      description: "new pickup request for io #{@io.id}",
      item_owner_id: @io.id
      )
---
INSERT INTO "pickup_requests" ("description", "created_at", "updated_at", "item_owner_id", "confirmation_token") VALUES (?, ?, ?, ?, ?)  [["description", "new pickup request for io 2"], ["created_at", "2019-09-27 16:30:12.574898"], ["updated_at", "2019-09-27 16:30:12.574898"], ["item_owner_id", 2], ["confirmation_token", "JYMSqr0V"]]

  def request_pickup
    @pri = PickupRequestItem.new
    @pr = PickupRequest.find(params[:pickup_request_id])
---
SELECT  "pickup_requests".* FROM "pickup_requests" WHERE "pickup_requests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @io.update(item_owners_params)
---
UPDATE "item_owners" SET "first_name" = ?, "updated_at" = ? WHERE "item_owners"."id" = ?  [["first_name", "Doe"], ["updated_at", "2019-09-23 16:48:47.385370"], ["id", 3]]