app/controllers/item_owners/pickup_requests_controller.rb

SELECT  "pickup_requests".* FROM "pickup_requests" WHERE "pickup_requests"."confirmation_token" = ? LIMIT ?  [["confirmation_token", "JYMSqr0V"], ["LIMIT", 1]]
---
    def pr_confirmation
        @pr = PickupRequest.find_by(confirmation_token: params[:confirmation])