app/controllers/item_owners/pickup_request_items_controller.rb

    def create
        @pri = PickupRequestItem.new(pickup_request_items_params)
        @pri.save!
---
INSERT INTO "pickup_request_items" ("item_name", "item_brand", "item_description", "item_condition", "created_at", "updated_at", "pickup_request_id") VALUES (?, ?, ?, ?, ?, ?, ?)