app/controllers/item_owners/pickup_requests_controller.rb

    def submit_pr
        @io.pickup_request.update(submitted: true)
---
UPDATE "pickup_requests" SET "submitted" = ?, "updated_at" = ? WHERE "pickup_requests"."id" = ?  [["submitted", "t"], ["updated_at", "2019-09-25 02:44:42.949739"], ["id", 12]]

    def set_pr
        @pr = PickupRequest.find(params[:id])
---
SELECT  "pickup_requests".* FROM "pickup_requests" WHERE "pickup_requests"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]