app/views/item_owners/item_owners/request_pickup.html.erb

SELECT COUNT(*) FROM "pickup_request_items" WHERE "pickup_request_items"."pickup_request_id" = ?  [["pickup_request_id", 2]]
---
                Request a pickup:
                <%= pluralize(@pr.pickup_request_items.count, "item") %> added